Revit 2024 API
SunAndShadowSettings.Azimuth Property
 Azimuth setting (angle in radians). This is only relevant when dealing with a SunAndShadowSettings element that uses lighting mode.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public double Azimuth { get; set; }
Visual Basic
Public Property Azimuth As Double
	Get
	Set
Visual C++
public:
property double Azimuth {
	double get ();
	void set (double value);
}
Field Value
 Azimuth angle (radians)
See Also
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace